var arr_topic = [
     [
          '以下哪种类型是B/S构架的正确描述?。',
          [
               ['需要安装客户端的软件','no'],
               ['不需要安装就可以使用的软件','no'],
               ['依托浏览器的网络系统','yes'],
               ['依托outlook等软件的邮件系统','no']
          ]
     ],[
          'PHP中，单引号和双引号所包围的字符串有什么区别?',
          [
               ['单引号速度快，双引号速度慢','yes'],
               ['双引号速度快，单引号速度慢','no'],
               ['两者没有速度差别','no'],
               ['双引号解析其中以$开头的变量，而单引号不解析 ','yes']
          ]
     ],[
          '下列描述正确的是?',
          [
               ['JavaScript是一种编译型语言','no'],
               ['JavaScript是一种基于对象和事件驱动的编程语言','yes'],
               ['JavaScript中变量声明采用强定义类型  ','no'],
               ['JavaScript采用静态联编  ','no']
          ]
     ], [
          '要想在网页中输出”<”正确的方法是?',
          [
               ['&','no'],
               ['<','yes'],
               ['>','no'],
               ['”','no']
          ]
     ],[
          'session和cookie的区别说法错误的是?',
          [
               ['session 和 cookie 都可以记录数据状态','no'],
               ['在设置session 和cookie 之前不能有输出。','no'],
               ['在使用cookie 前要使用 cookie_start()函数初始 ','yes'],
               ['Cookie是客户端技术，session是服务器端技术 ','no']
          ]
     ],[
          '以下修改配置的说法错误的是?',
          [
               ['使用 set_magic_quotes_runtime()函数可以修改页面过期时间','yes'],
               ['PHP 的配置文件选项存放在php.ini文件中','no'],
               ['Linux 下修改了php.ini文件需要重启apache服务  ','no'],
               ['默认网页过期时间是30s','no']
          ]
     ], [
          'Cookie最大长度是?',
          [
               ['1KB','no'],
               ['2KB','no'],
               ['3KB','yes'],
               ['4KB','no']
          ]
     ],[
          'mysql_connect()与@mysql_connect()的区别是?',
          [
               ['@mysql_connect()不会忽略错误,将错误显示到客户端 ','no'],
               ['mysql_connect()不会忽略错误,将错误显示到客户端 ','yes'],
               ['没有区别 ','no'],
               ['功能不同的两个函数 ','no']
          ]
     ],[
          '下列说法正确的是:',
          [
               ['数组的下标必须为数字，且从”0″开始 ','yes'],
               ['数组的下标可以是字符串','no'],
               ['数组中的元素类型必顺一致 ','no'],
               ['数组的下标必须是连续的 ','no']
          ]
     ],[
          '取得搜索语句的结果集中的记录总数的函数是:',
          [
               ['mysql_fetch_row ','no'],
               ['mysql_rowid ','no'],
               ['mysql_num_rows ','yes'],
               ['mysql_fetch_array ','no']
          ]
     ],[
          '关于mysql_fetch_object说法中，正确的是?',
          [
               ['mysql_fetch_object和mysql_fetch_array一样，没什么区别','no'],
               ['mysql_fetch_object返回值是个对象，所以在速度上比mysql_fetch_array要慢','yes'],
               ['mysql_fetch_object返回值是个数组，所以在速度上和mysql_fetch_array及mysql_fetch_row差不多','no'],
               ['mysql_fetch_object返回值是个对象，在速度上和mysql_fetch_array及mysql_fetch_row差不多','no']
          ]
     ],[
          '关于exit( )与die( )的说法正确的是?',
          [
               ['当exit( )函数执行会停止执行下面的脚本，而die()无法做到','no'],
               ['当die()函数执行会停止执行下面的脚本，而exit( )无法做到 ','no'],
               ['die()函数等价于exit()函数 ','no'],
               ['die()函数与exit()函数没有直接关系  ','yes']
          ]
     ],[
          '在声明是xml文件时 表示该文件是个独立文件，没有使用外部的DTD用到的属性是?',
          [
               ['version','no'],
               ['encoding','no'],
               ['standalone ','yes'],
               ['schema','no']
          ]
     ],[
          '修改MySQL用户root的密码的指令是：',
          [
               ['mysqladmin -u root password test','yes'],
               ['mysql -u root password test  ','no'],
               ['mysql -u root -p test ','no'],
               ['mysql -u root -password test','no']
          ]
     ],[
          '对于现实世界中事物的特征，在实体-联系模型中使用?',
          [
               ['属性描述','yes'],
               ['关键字描述','no'],
               ['二维表格描述','no'],
               ['实体描述','no']
          ]
     ],[
          '在数据库设计中，将ER图转换成关系数据模型的过程属于?',
          [
               ['需求分析阶段','no'],
               ['逻辑设计阶段','yes'],
               ['概念设计阶段','no'],
               ['物理设计阶段','no']
          ]
     ],[
          '设有部门和职员两个实体，每个职员只能属于一个部门，一个部门可以有多名职员。则部门与职员实体之间的联系类型是?',
          [
               ['m:n','no'],
               ['1:m','yes'],
               ['m:1','no'],
               ['1:1','no']
          ]
     ],[
          '使用SQL语句进行分组检索时，为了去掉不满足条件的分组。应当?',
          [
               ['使用WHERE子句','no'],
               ['在GROUP BY后面使用HAVING子句','yes'],
               ['先使用WHERE子句再使用HAVING子句','no'],
               ['先使用HAVING 子句再使用WHERE子句','no']
          ]
     ],[
          '关系表达式运算的结果是?',
          [
               ['数值型','no'],
               ['字符型','no'],
               ['逻辑型','yes'],
               ['日期型','no']
          ]
     ],[
          '储蓄所有多个储户，储户在多个储蓄所存取款。储蓄所与储户之间是?',
          [
               ['一对一的联系','no'],
               ['一对多的联系','yes'],
               ['多对一的联系','no'],
               ['多对多的联系','no']
          ]
     ],[
          '视图是一个“虚表”视图的构造基于?',
          [
               ['基本表','no'],
               ['视图','no'],
               ['基本表或视图','yes'],
               ['数据字典','no']
          ]
     ],[
          '设有关系模式EMP职工号、姓名、年龄技能。假设职工号唯一,每个职工有多项技能,则EMP表的主键是?',
          [
               ['职工号','yes'],
               ['姓名技能','no'],
               ['技能','no'],
               ['职工号技能','no']
          ]
     ],[
          '在SQL语句中与表达式 "仓库号 NOT IN"wh1","wh2""功能相同的表达式是?',
          [
               ['仓库号="wh1" AND 仓库号="wh2"','no'],
               ['仓库号!="wh1" OR 仓库号= "wh2"','no'],
               ['仓库号仓库号="wh1" OR 仓库号="wh2"','no'],
               ['仓库号!="wh1" AND 仓库号!="wh2"','yes']
          ]
     ],[
          '在SQL SELECT语句中用于实现关系的选择运算的短语是?',
          [
               ['FOR','no'],
               ['WHILE','no'],
               ['WHERE','yes'],
               ['CONDITION','no']
          ]
     ],[
          '关系数据库中,实现主键标识元组的作用是通过(__)来实现的?',
          [
               ['实体完整性规则','yes'],
               ['参照完整性规则','no'],
               ['用户自定义的完整性','no'],
               ['属性的值域 ','no']
          ]
     ],[
          '根据关系模式的完整性规则，一个关系中的主键?',
          [
               ['不能有两个','no'],
               ['不能成为另一个关系的外部键','no'],
               ['不允许空值','yes'],
               ['可以取空值','no']
          ]
     ],[
          '若规定工资表中基本工资不得超过5000元,则这个规定属于?',
          [
               ['关系完整性','no'],
               ['体完整性约束 ','no'],
               ['参照完整性','no'],
               ['用户定义完整性','yes']
          ]
     ],[
          '关系模型中,实体完整性是指?',
          [
               ['实体不允许是空实体','no'],
               ['实体的主键值不允许是空值','yes'],
               ['实体的属性值不能是空值','no'],
               ['实体的外键值不允许是空值','no']
          ]
     ],[
          '关系数据库中,外码(ForeignKey)是?',
          [
               ['在一个关系中定义了约束的一个或一组属性','no'],
               ['在一个关系中定义了缺省值的一个或一组属性','no'],
               ['在一个关系中的一个或一组属性是另一个关系的主码','yes'],
               ['在一个关系中用于唯一标识元组的一个或一组属性','no']
          ]
     ],[
          '以下哪些命令是DDL语句?(',
          [
               ['CREATE DATABASE命令','yes'],
               ['ALTER TABLE命令','no'],
               ['SELECT 命令','no'],
               ['INSERT命令','no']
          ]
     ],[
          '在SQL中删除视图用______?',
          [
               ['DROP SCHEMA命令','no'],
               ['CREATE TABLE命令','no'],
               ['ROP VIEW命令','yes'],
               ['DROP INDEX命令','no']
          ]
     ],[
          'SQL语句中修改表结构的命令是______?',
          [
               ['MODIFY TABLE','no'],
               ['MODIFY STRUCTURE','no'],
               ['ALTER TABLE','yes'],
               ['ALTER STRUCTURE','no']
          ]
     ],[
          'SQL语言具有_______的功能?',
          [
               ['关系规范化、数据操纵、数据控制 ','no'],
               ['数据定义、数据操纵、数据控制','yes'],
               ['数据定义、关系规范化、数据控制','no'],
               ['数据定义、关系规范化、数据操纵','no']
          ]
     ],[
          '在关系模型中实现"关系中不允许出现相同的元组"的约束是通过______?',
          [
               ['候选键','no'],
               ['主键','yes'],
               ['外键','no'],
               ['超键','no']
          ]
     ],[
          'DELETE FROM S WHERE 年龄>60 语句的功能是______?',
          [
               ['从S表中彻底删除年龄大于60岁的记录','yes'],
               ['S表中年龄大于60岁的记录被加上删除标记','no'],
               ['删除S表 ','no'],
               ['删除S表的年龄列','no']
          ]
     ],[
          '下列描述正确的是?',
          [
               ['一个数据库只能包含一个数据表','no'],
               ['一个数据库可以包含多个数据表','yes'],
               ['一个数据库只能包含两个数据表','no'],
               ['一个数据表可以包含多个数据库','no']
          ]
     ],[
          '下列有关数据库的描述正确的是?',
          [
               ['数据库是一个DBF文件','no'],
               ['数据库是一个关系','no'],
               ['数据库是一个结构化的数据集合','yes'],
               ['数据库是一组文件','no']
          ]
     ],[
          '在SELECT语句中,只列出前几行的关键字是?',
          [
               ['limit','yes'],
               ['distinct','no'],
               ['del','no'],
               ['from','no']
          ]
     ],[
          '区分不同实体的依据是',
          [
               ['名称','no'],
               ['属性','yes'],
               ['对象','no'],
               ['概念','no']
          ]
     ],[
          'SQL语句中修改表结构的命令是______?',
          [
               ['MODIFY TABLE','no'],
               ['MODIFY STRUCTURE','no'],
               ['ALTER TABLE','yes'],
               ['ALTER STRUCTURE','no']
          ]
     ],[
          '为了对某表中的各行进行快速访问应对此表建立?',
          [
               ['约束','no'],
               ['存储过程','no'],
               ['规则','no'],
               ['索引','yes'],
               ['视图','no']
          ]
     ],[
          '在SQL数据库中关于视图的描述错误的是?',
          [
               ['视图是一个虚拟的表在物理介质上并不存在 ','no'],
               ['视图可以查看来自一个或多个表的内容','no'],
               ['修改了视图的数据原始数据并不会被修改 ','yes'],
               ['使用CREATE VIEW来创建视图','no']
          ]
     ]
























	];